Tekla Open API Reference for Tekla Structures 2025
RebarHookData Properties
The RebarHookData type exposes the following members.
Properties
Name | Description
Angle
 The angle of the hook. The value is between -270 to +270 degrees.
Length
 The length of the straight part of the hook.
Radius
 The bending radius of the hook.
Shape
 Defines the shape of the hook. The options are:
NO_HOOK. Sets the angle, radius and length to 0.
HOOK_90_DEGREES.
HOOK_135_DEGREES.
HOOK_180_DEGREES.
CUSTOM_HOOK. The angle, radius and length values have to be set manually.
Top
See Also
Reference
RebarHookData Class
Tekla.Structures.Model Namespace